/**
 * ثابت‌های مورد نیاز برای کلاس Jalali
 */

export const DAYS_IN_MONTH = Object.freeze([
  31, 31, 31, 31, 31, 31, 30, 30, 30, 30, 30, 29,
]);

export const MONTH_NAMES = Object.freeze([
  "فروردین",
  "اردیبهشت",
  "خرداد",
  "تیر",
  "مرداد",
  "شهریور",
  "مهر",
  "آبان",
  "آذر",
  "دی",
  "بهمن",
  "اسفند",
]);

export const DAY_NAMES = Object.freeze([
  "شنبه",
  "یکشنبه",
  "دوشنبه",
  "سه‌شنبه",
  "چهارشنبه",
  "پنج‌شنبه",
  "جمعه",
]);

export const SEASONS = Object.freeze({
  SPRING: "بهار",
  SUMMER: "تابستان",
  AUTUMN: "پاییز",
  WINTER: "زمستان",
});

export const SPECIAL_DAYS = Object.freeze({
  "1/1": "نوروز",
  "1/4": "ولادت امام علی (ع)",
  "1/12": "ولادت امام زمان (عج)",
  "1/13": "سیزده بدر",
  "3/15": "ولادت امام حسن مجتبی (ع)",
  "6/30": "ولادت امام رضا (ع)",
  "8/15": "ولادت امام علی النقی (ع)",
  "9/20": "ولادت امام رضا (ع)",
  "10/5": "ولادت امام جعفر صادق (ع)",
  "11/9": "ولادت امام حسن عسکری (ع)",
  "12/8": "ولادت امام رضا (ع)",
  "12/29": "ولادت امام علی (ع)",
});
